; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	infrared1 - mode
	image2 - mode
	Star3 - direction
	GroundStation7 - direction
	GroundStation14 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	GroundStation12 - direction
	Star6 - direction
	Star11 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation10 - direction
	Star8 - direction
	GroundStation9 - direction
	Star13 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 Star8)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation14)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star11)
	(supports instrument5 image2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation10)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet18)
)
(:goal (and
	(have_image Planet16 image2)
	(have_image Phenomenon17 image2)
	(have_image Planet18 infrared1)
	(have_image Star19 image2)
	(have_image Phenomenon20 image2)
	(have_image Phenomenon21 image0)
))

)

; plan
1. (turn_to satellite0 groundstation14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation14)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation14)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon21 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon21)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon21 instrument0 image0)
   added: (have_image phenomenon21 image0)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon20 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon20)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon20 instrument0 image2)
   added: (have_image phenomenon20 image2)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon17 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon17 instrument0 image2)
   added: (have_image phenomenon17 image2)
   goals met: 3 of 6
10. (turn_to satellite0 planet16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet16)
   goals met: 3 of 6
11. (take_image satellite0 planet16 instrument0 image2)
   added: (have_image planet16 image2)
   goals met: 4 of 6
12. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 4 of 6
13. (take_image satellite0 planet18 instrument0 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 5 of 6
14. (turn_to satellite0 star19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star19)
   goals met: 5 of 6
15. (take_image satellite0 star19 instrument0 image2)
   added: (have_image star19 image2)
   goals met: 6 of 6
